Tekla Open API Reference for Tekla Structures 2025
Polyline Properties
The Polyline type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the polyline.
Bulge
 The bulge (curve) to use for the polyline (a bulge is the ratio between the height and width of an object).
Bulges
 The list of individual bulges for the polygon.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
Points
 The list of points for the polyline.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Polyline Class
Tekla.Structures.Drawing Namespace